fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРабот/ВКМ_ЗаполнениеГрафикаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафикаРабот</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРабот</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРабот/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет график работы за указанный период в днях.
//
// Параметры:
//   ДатаНачала    - Дата - начало периода заполнения.
//   ДатаОкончания - Дата - окончание периода заполнения.
//   ВыходныеДни   - Строка - номера выходных дней недели через запятую,
//       например "6,7" - суббота и воскресенье.
//   ГрафикРабот   - СправочникСсылка.ВКМ_ГрафикиРабот - заполняемый график.
//
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРабот) Экспорт
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРабот.Установить(ГрафикРабот);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДатаКЗаписи = ДатаНачала;
	
	Для НомерЗаписи = 0 По Набор.Количество() - 1 Цикл
		
		Запись = Набор[НомерЗаписи];
		
		Если Запись.Дата < ДатаНачала Тогда
			
			Продолжить;
			
		ИначеЕсли Запись.Дата = ДатаКЗаписи Тогда
			
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) > 0 Тогда
				Запись.Значение = 0;
			Иначе
				Запись.Значение = 1;
			КонецЕсли;
			
			ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
			
		Иначе
			
			Пока ДатаКЗаписи < Мин(Запись.Дата, ДатаОкончания) Цикл
				
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРабот = ГрафикРабот;
				НоваяЗапись.Дата = ДатаКЗаписи;
				
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) > 0 Тогда
					НоваяЗапись.Значение = 0;
				Иначе
					НоваяЗапись.Значение = 1;
				КонецЕсли;
				
				ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
				
			КонецЦикла;
			
			Если Запись.Дата > ДатаОкончания Тогда
				
				Прервать;
				
			Иначе
				
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) > 0 Тогда
					Запись.Значение = 0;
				Иначе
					Запись.Значение = 1;
				КонецЕсли;
				
			КонецЕсли;
			
			ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Пока ДатаКЗаписи <= ДатаОкончания Цикл
		
		Запись = Набор.Добавить();
		Запись.ГрафикРабот = ГрафикРабот;
		Запись.Дата = ДатаКЗаписи;
		
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) > 0 Тогда
			Запись.Значение = 0;
		Иначе
			Запись.Значение = 1;
		КонецЕсли;
		
		ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
		
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
